
&НаСервере
Процедура ОД_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	ЭлДогСЗаказчиком = Элементы.Добавить("ОД_ДоговорСЗаказчиком", Тип("ПолеФормы"), Элементы.КолонкаЛево);
	ЭлДогСЗаказчиком.Вид = ВидПоляФормы.ПолеВвода;
	ЭлДогСЗаказчиком.ПутьКДанным = "Объект.ОД_ДоговорСЗаказчиком";
	ЭлДогСЗаказчиком.ТолькоПросмотр = Истина;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьДоговорСЗаказчиком();
	Иначе
		ЗаполнитьДоговорСЗаказчиком();	
	КонецЕсли;     
	
	НЭ = Элементы.Добавить("ОД_ИзППМ", Тип("ПолеФормы"), Элементы.КолонкаЛево);
	НЭ.Вид = ВидПоляФормы.ПолеФлажка;
	НЭ.ПутьКДанным = "Объект.ОД_ИзППМ";
	НЭ.Заголовок = "Из ППМ";
	НЭ.Доступность = Ложь; 
	
	ЭлементПрорабОД = Элементы.Добавить("ОД_ОтветственныйПрораб", Тип("ПолеФормы"), Элементы.КолонкаПраво);
	ЭлементПрорабОД.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементПрорабОД.ПутьКДанным = "Объект.ОД_ОтветственныйПрораб"; 
	ЗаполнитьОтветственногоПрораба();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоговорСЗаказчиком()

	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;		
	КонецЕсли;
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		Объект.ОД_ДоговорСЗаказчиком = Объект.ДокументОснование.ОД_ДоговорСЗаказчиком;
	ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Объект.ОД_ДоговорСЗаказчиком = Объект.ДокументОснование.Договор;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтветственногоПрораба() 
	Если Объект.ДокументОснование <> Неопределено Тогда
		Если ТипЗнч(Объект.ДокументОснование.Ссылка) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") И НЕ Объект.ДокументОснование.Ссылка.Пустая() Тогда   
			Объект.ОД_ОтветственныйПрораб = Объект.ДокументОснование.ОД_ОтветственныйПрораб;		
		Иначе
			Объект.ОД_ОтветственныйПрораб = Справочники.Сотрудники.ПустаяСсылка();	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
