
&НаСервере
Процедура ОД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавляемыеРеквизиты = Новый Массив; 
	Рек_Марж = Новый РеквизитФормы("ОД_Маржинальность",	Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)), , "Маржинальность");
	ДобавляемыеРеквизиты.Добавить(Рек_Марж);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Эл_Марж = Элементы.Добавить("ОД_Маржинальность", Тип("ПолеФормы"), Элементы.ГруппаПанельДереваРабот);
	Эл_Марж.Вид = ВидПоляФормы.ПолеВвода;
	Эл_Марж.ТолькоПросмотр = Истина;
	Эл_Марж.ПутьКДанным = "ОД_Маржинальность";
	
	ЗаполнитьМаржинальностьНаФорме();
		
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьМаржинальностьНаФорме()
	
	ДобСтоим = 0; 
	ЗакСтоим = 0;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УНСФ_ПланированиеРабот.НакладныеРасходы КАК НакладныеРасходы,
		|	УНСФ_ПланированиеРабот.ЦенаЗаказчика КАК ЦенаЗаказчика,
		|	УНСФ_ПланированиеРабот.ЦенаСубподрядчика КАК ЦенаСубподрядчика,
		|	УНСФ_ПланированиеРабот.СуммаСубподрядчика КАК СуммаСубподрядчика
		|ИЗ
		|	РегистрСведений.УНСФ_ПланированиеРабот КАК УНСФ_ПланированиеРабот
		|ГДЕ
		|	УНСФ_ПланированиеРабот.СценарийПланирования = &СценарийПланирования";
	Запрос.УстановитьПараметр("СценарийПланирования", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗакСтоим = ЗакСтоим + ВыборкаДетальныеЗаписи.ЦенаЗаказчика;
		ДобСтоим = ДобСтоим + ВыборкаДетальныеЗаписи.ЦенаЗаказчика - ВыборкаДетальныеЗаписи.НакладныеРасходы 
			- ВыборкаДетальныеЗаписи.СуммаСубподрядчика;
		КонецЦикла;
		
	Если ЗакСтоим <> 0 Тогда	
		ЭтаФорма.ОД_Маржинальность = ДобСтоим / ЗакСтоим * 100;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОД_ДеревоРаботыНакладныеРасходыПриИзмененииПосле(Элемент)
	ЗаполнитьМаржинальностьНаФорме();
КонецПроцедуры

&НаКлиенте
Процедура ОД_ДеревоРаботыЦенаЗаказчикаПриИзмененииПосле(Элемент)
	ЗаполнитьМаржинальностьНаФорме();
КонецПроцедуры
