
&Перед("ОбработкаЗаполнения")
Процедура ОД_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		ЭтотОбъект.ОД_ИзППМ = ДанныеЗаполнения.ОД_ИзППМ;
		Если ДанныеЗаполнения.ОД_Состояние <> Перечисления.ОД_СостоянияСчетовНаОплатуОтПоставщиков.Согласован Тогда
			ВызватьИсключение("Документ должен иметь состояние ""Согласован""");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда  
		ЭтотОбъект.ОД_ИзППМ = ДанныеЗаполнения.ОД_ИзППМ;
		Если ДанныеЗаполнения.СостояниеЗаказа <> Справочники.СостоянияЗаказовПоставщикам.НайтиПоНаименованию("Согласован") Тогда
			ВызватьИсключение("Документ должен иметь состояние ""Согласован""");
			Возврат;	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&После("ПередЗаписью")
Процедура ОД_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда	
		
		ДобавитьЗаписьВРегистрЖурналаДокументовСогласование(Истина); 
		
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасходДСПлан.СтатусУтвержденияПлатежа КАК СтатусУтвержденияПлатежа
			|ИЗ
			|	Документ.РасходДСПлан КАК РасходДСПлан
			|ГДЕ
			|	РасходДСПлан.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);	
		РезультатЗапроса = Запрос.Выполнить();		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Если ВыборкаДетальныеЗаписи.СтатусУтвержденияПлатежа <> ЭтотОбъект.СтатусУтвержденияПлатежа Тогда
				ДобавитьЗаписьВРегистрЖурналаДокументовСогласование(Ложь);	
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры 

Процедура ДобавитьЗаписьВРегистрЖурналаДокументовСогласование(НовыйДокумент)

	НаборЗаписей = РегистрыСведений.ОД_ЖурналДействийСогласовний.СоздатьМенеджерЗаписи(); 

	НаборЗаписей.Период = ТекущаяДата();
	НаборЗаписей. Дата = ТекущаяДата(); 
	НаборЗаписей.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Если НовыйДокумент Тогда  
		ЭтотОбъект.УстановитьСсылкуНового(Документы.РасходДСПлан.ПолучитьСсылку());	
		НаборЗаписей.Документ = ПолучитьСсылкуНового();	
	Иначе
		НаборЗаписей.Документ = ЭтотОбъект.Ссылка;	
	КонецЕсли;	 
	
	Если ЭтотОбъект.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден Тогда
		НаборЗаписей.СтатусСогласования = "Утвержден";		
	ИначеЕсли ЭтотОбъект.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.НеУтвержден Тогда
		НаборЗаписей.СтатусСогласования = "Не утвержден";	
	КонецЕсли;
		

	НаборЗаписей.Записать();
	
КонецПроцедуры

