
Процедура ОтправитьСообщениеТелеграмм(ВыбЗнач, Получатель, ДопПараметры, Заказ)  Экспорт
	    //  6130336998:AAHe2SAaezdAUsaMLyZ3RFg7RTde1tOP5DI
		Ключ 			= ДопПараметры;
		Сервер 			= "api.telegram.org";
		
		Команда = "sendMessage";
		
 		Ресурс = "bot"+Ключ+"/"+Команда+"?chat_id="+Формат(Получатель,"ЧГ=")+"&text="+ Заказ + " " +СокрЛП(ВыбЗнач);
		Попытка
			Соединение = Новый HTTPСоединение(Сервер,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
			Запрос = Новый HTTPЗапрос(Ресурс); 
			
			Ответ = Соединение.Получить(Запрос);
			Чтение = Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
			
			ОтветСоотв = ПрочитатьJSON(Чтение,Истина);
			ok = ОтветСоотв["ok"] ;
		Исключение 
			//ОбщегоНазначения.СообщитьПользователю("Отправка не удалась" + "" + ОписаниеОшибки());
			////ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), УровеньЖурналаРегистрации.Ошибка,,, 
			////	ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
        КонецПопытки;
			
КонецПроцедуры
	
