
&НаСервере
&Вместо("ПересчитатьСуммыТабличныхЧастей")
Процедура ОД_ПересчитатьСуммыТабличныхЧастей()
	
	//=======================================================================================
	
	////БЫЛО
	//Для Каждого СтрокаТЧ Из Объект.Материалы Цикл
	//	
	//	СтрокаТЧ.КоличествоВсего = СтрокаТЧ.Количество * Объект.Объем;
	//	СтрокаТЧ.Сумма = СтрокаТЧ.КоличествоВсего * СтрокаТЧ.Цена;
	//	                                        
	//КонецЦикла;  	
	//
	//Для Каждого СтрокаТЧ Из Объект.Ресурсы Цикл
	//	
	//	СтрокаТЧ.КоличествоВсего = СтрокаТЧ.Количество * Объект.Объем;
	//	СтрокаТЧ.Сумма = СтрокаТЧ.КоличествоВсего * СтрокаТЧ.Цена;
	//	
	//КонецЦикла;
	//
	//Объект.СуммаПозиции = Объект.Материалы.Итог("Сумма")+Объект.Ресурсы.Итог("Сумма");
	
	//=======================================================================================
	
	////СТАЛО  
	
	Для Каждого СтрокаТЧ Из Объект.Материалы Цикл
		
		Если СтрокаТЧ.Номенклатура.ОД_Неокругляемый Тогда
			СтрокаТЧ.КоличествоВсего = СтрокаТЧ.Количество * Объект.Объем;
			СтрокаТЧ.КоличествоВсего = ?(Цел(СтрокаТЧ.КоличествоВсего) = СтрокаТЧ.КоличествоВсего, СтрокаТЧ.КоличествоВсего, Цел(СтрокаТЧ.КоличествоВсего) + 1);
			
			Если СтрокаТЧ.КоличествоВсего < СтрокаТЧ.Номенклатура.ОД_КратностьОкругления Тогда
				СтрокаТЧ.КоличествоВсего = СтрокаТЧ.Номенклатура.ОД_КратностьОкругления;	
			КонецЕсли;
			
			Если СтрокаТЧ.КоличествоВсего % СтрокаТЧ.Номенклатура.ОД_КратностьОкругления <> 0 Тогда
				СтрокаТЧ.КоличествоВсего = СтрокаТЧ.КоличествоВсего + СтрокаТЧ.Номенклатура.ОД_КратностьОкругления - (СтрокаТЧ.КоличествоВсего % СтрокаТЧ.Номенклатура.ОД_КратностьОкругления);	
			КонецЕсли;
			
			//СтрокаТЧ.Сумма = (СтрокаТЧ.КоличествоВсего * СтрокаТЧ.Цена) / СтрокаТЧ.Количество;
			СтрокаТЧ.Сумма = СтрокаТЧ.КоличествоВсего * СтрокаТЧ.Цена;
		Иначе
			СтрокаТЧ.КоличествоВсего = СтрокаТЧ.Количество * Объект.Объем;
			СтрокаТЧ.Сумма = СтрокаТЧ.КоличествоВсего * СтрокаТЧ.Цена;
		КонецЕсли;
		
		                                        
	КонецЦикла;  	
	
	Для Каждого СтрокаТЧ Из Объект.Ресурсы Цикл
		
		СтрокаТЧ.КоличествоВсего = СтрокаТЧ.Количество * Объект.Объем;
		СтрокаТЧ.Сумма = СтрокаТЧ.КоличествоВсего * СтрокаТЧ.Цена;
		
	КонецЦикла;
	
	Объект.СуммаПозиции = Объект.Материалы.Итог("Сумма")+Объект.Ресурсы.Итог("Сумма");
	
	//=======================================================================================
	
	
	
КонецПроцедуры
