
&Перед("ОбработкаЗаполнения")
Процедура ОД_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		Если ДанныеЗаполнения.ОД_Состояние <> Перечисления.ОД_СостоянияСчетовНаОплатуОтПоставщиков.Согласован Тогда
			ВызватьИсключение("Документ должен иметь состояние ""Согласован""");
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Если ДанныеЗаполнения.СостояниеЗаказа <> Справочники.СостоянияЗаказовПоставщикам.НайтиПоНаименованию("Согласован") Тогда
			ВызватьИсключение("Документ должен иметь состояние ""Согласован""");
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
