
&Перед("ОбработкаПроверкиЗаполнения")
Процедура ОД_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("Комментарий");
	ПроверяемыеРеквизиты.Добавить("ЗаказПокупателя");
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура ОД_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда	
		
		ДобавитьЗаписьВРегистрЖурналаДокументовСогласование(Истина);
		ДобавитьЗаписиВРегистрЖурналаДокументовТабличнаяЧастьНовыйДокумент();
		
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказПоставщику.СостояниеЗаказа КАК СостояниеЗаказа
			|ИЗ
			|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
			|ГДЕ
			|	ЗаказПоставщику.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);	
		РезультатЗапроса = Запрос.Выполнить();		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Если ВыборкаДетальныеЗаписи.СостояниеЗаказа <> ЭтотОбъект.СостояниеЗаказа Тогда
				ДобавитьЗаписьВРегистрЖурналаДокументовСогласование(Ложь);	
			КонецЕсли;
			
		КонецЕсли;
		
		ДобавитьЗаписиВРегистрЖурналаДокументовТабличнаяЧастьСуществующийДокумент();
		
	КонецЕсли;

КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура ОД_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Попытка
			ЭтотОбъект.Организация = ДанныеЗаполнения.Договор.Организация;	
		Исключение
			
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьЗаписьВРегистрЖурналаДокументовСогласование(НовыйДокумент)

	НаборЗаписей = РегистрыСведений.ОД_ЖурналДействийСогласовний.СоздатьМенеджерЗаписи(); 

	НаборЗаписей.Период = ТекущаяДата();
	НаборЗаписей. Дата = ТекущаяДата(); 
	НаборЗаписей.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Если НовыйДокумент Тогда  
		ЭтотОбъект.УстановитьСсылкуНового(Документы.ЗаказПоставщику.ПолучитьСсылку());	
		НаборЗаписей.Документ = ПолучитьСсылкуНового();	
	Иначе
		НаборЗаписей.Документ = ЭтотОбъект.Ссылка;	
	КонецЕсли;
	
	Если ЭтотОбъект.СостояниеЗаказа = Справочники.СостоянияЗаказовПоставщикам.НайтиПоНаименованию("Согласован") Тогда
		НаборЗаписей.СтатусСогласования = "Согласован";		
	Иначе
		НаборЗаписей.СтатусСогласования = Строка(ЭтотОбъект.СостояниеЗаказа);	
	КонецЕсли;
		

	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ДобавитьЗаписиВРегистрЖурналаДокументовТабличнаяЧастьНовыйДокумент()
	
	ЭтотОбъект.УстановитьСсылкуНового(Документы.ЗаказПоставщику.ПолучитьСсылку());	
	
	НЗ = РегистрыСведений.ОД_ЖурналДействийТабличныеЧасти.СоздатьНаборЗаписей();
	НЗ.Отбор.Дата.Установить(ТекущаяДата());
	
	Для Каждого Значение из ЭтотОбъект.Запасы Цикл
		Н = НЗ.Добавить();
		Н.Период = ТекущаяДата();
		
		Н.Дата = ТекущаяДата();
		Н.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
		Н.НомерСтрокиТЧ = Значение.НомерСтроки;
		Н.Документ = ПолучитьСсылкуНового();
		
		Н.Номенклатура = Значение.Номенклатура;
		Н.Характеристика = Значение.Характеристика;
		Н.КолВо = Значение.Количество;
		Н.Цена = Значение.Цена;
		Н.СтавкаНДС = Значение.СтавкаНДС;
		Н.Всего = Значение.Всего; 
		
		Н.Комментарий = "Создание документа!";
	КонецЦикла;
	
	НЗ.Записать();
	
КонецПроцедуры   

Процедура ДобавитьЗаписиВРегистрЖурналаДокументовТабличнаяЧастьСуществующийДокумент()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОД_ЖурналДействийТабличныеЧасти.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ОД_ЖурналДействийТабличныеЧасти КАК ОД_ЖурналДействийТабличныеЧасти
		|ГДЕ
		|	ОД_ЖурналДействийТабличныеЧасти.Документ = &ЭтотДок
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ЭтотДок", ЭтотОбъект.Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДатаВыборки = ВыборкаДетальныеЗаписи.Дата;	
	Иначе
		НЗ = РегистрыСведений.ОД_ЖурналДействийТабличныеЧасти.СоздатьНаборЗаписей();
		НЗ.Отбор.Дата.Установить(ТекущаяДата());
		
		Для Каждого Значение из ЭтотОбъект.Запасы Цикл
			Н = НЗ.Добавить();
			Н.Период = ТекущаяДата();
			
			Н.Дата = ТекущаяДата();
			Н.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
			Н.НомерСтрокиТЧ = Значение.НомерСтроки;
			Н.Документ = ЭтотОбъект.Ссылка;
			
			Н.Номенклатура = Значение.Номенклатура;
			Н.Характеристика = Значение.Характеристика;
			Н.КолВо = Значение.Количество;
			Н.Цена = Значение.Цена;
			Н.СтавкаНДС = Значение.СтавкаНДС;
			Н.Всего = Значение.Всего; 
			
			Н.Комментарий = "Первая запись по документу!";
		КонецЦикла;
		
		НЗ.Записать();
		
		Возврат;	
	КонецЕсли;
	
	
	МасСравнений = Новый Массив;
	МасДляРегистра = Новый Массив;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОД_ЖурналДействийТабличныеЧасти.Дата КАК Дата,
		|	ОД_ЖурналДействийТабличныеЧасти.Номенклатура КАК Номенклатура,
		|	ОД_ЖурналДействийТабличныеЧасти.Характеристика КАК Характеристика,
		|	ОД_ЖурналДействийТабличныеЧасти.КолВо КАК КолВо,
		|	ОД_ЖурналДействийТабличныеЧасти.Цена КАК Цена,
		|	ОД_ЖурналДействийТабличныеЧасти.СтавкаНДС КАК СтавкаНДС,
		|	ОД_ЖурналДействийТабличныеЧасти.Всего КАК Всего
		|ИЗ
		|	РегистрСведений.ОД_ЖурналДействийТабличныеЧасти КАК ОД_ЖурналДействийТабличныеЧасти
		|ГДЕ
		|	ОД_ЖурналДействийТабличныеЧасти.Документ = &ЭтотДок
		|	И ОД_ЖурналДействийТабличныеЧасти.Дата = &ДВ
		|	И ОД_ЖурналДействийТабличныеЧасти.Комментарий <> &ЗаписьУдалена";
	
	Запрос.УстановитьПараметр("ДВ", ДатаВыборки);
	Запрос.УстановитьПараметр("ЭтотДок", ЭтотОбъект.Ссылка); 
	Запрос.УстановитьПараметр("ЗаписьУдалена", "Запись удалена!");
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрукВозв = Новый Структура;
		СтрукВозв.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
		СтрукВозв.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);
		СтрукВозв.Вставить("КолВо", ВыборкаДетальныеЗаписи.КолВо);
		СтрукВозв.Вставить("Цена", ВыборкаДетальныеЗаписи.Цена);
		СтрукВозв.Вставить("СтавкаНДС", ВыборкаДетальныеЗаписи.СтавкаНДС);
		СтрукВозв.Вставить("Всего", ВыборкаДетальныеЗаписи.Всего);
		СтрукВозв.Вставить("БылаЗайдествована", Ложь);
		МасСравнений.Добавить(СтрукВозв);
	КонецЦикла; 
	
	Для Каждого ЗначениеИзДокумента из ЭтотОбъект.Запасы Цикл
		СтрукВозв = Новый Структура; 
		СтрукВозв.Вставить("НомерСтрокиТЧ", ЗначениеИзДокумента.НомерСтроки);
		СтрукВозв.Вставить("Номенклатура", ЗначениеИзДокумента.Номенклатура);
		СтрукВозв.Вставить("Характеристика", ЗначениеИзДокумента.Характеристика);
		СтрукВозв.Вставить("КолВо", ЗначениеИзДокумента.Количество);
		СтрукВозв.Вставить("Цена", ЗначениеИзДокумента.Цена);
		СтрукВозв.Вставить("СтавкаНДС", ЗначениеИзДокумента.СтавкаНДС);
		СтрукВозв.Вставить("Всего", ЗначениеИзДокумента.Всего);
		ЗначениеНайдено = Ложь;
		Для Каждого ЗначениеИзМасСрав из МасСравнений Цикл
			Если ЗначениеИзДокумента.Номенклатура = ЗначениеИзМасСрав.Номенклатура И 
				ЗначениеИзДокумента.Характеристика = ЗначениеИзМасСрав.Характеристика Тогда
				
				Ком = "";
				Если ЗначениеИзДокумента.Количество <> ЗначениеИзМасСрав.КолВо Тогда
					Ком = Ком + "Изменено кол-во / ";	
				КонецЕсли;
				Если ЗначениеИзДокумента.Цена <> ЗначениеИзМасСрав.Цена Тогда
					Ком = Ком + "Изменена цена / ";	
				КонецЕсли;
				Если ЗначениеИзДокумента.СтавкаНДС <> ЗначениеИзМасСрав.СтавкаНДС Тогда
					Ком = Ком + "Изменена ставка НДС / ";	
				КонецЕсли;
				Если ЗначениеИзДокумента.Всего <> ЗначениеИзМасСрав.Всего Тогда
					Ком = Ком + "Изменено всего / ";	
				КонецЕсли;
				Если СтрДлина(Ком) <> 0 Тогда
					Ком = Лев(Ком, СтрДлина(Ком) - 2);	
				КонецЕсли;                            
				СтрукВозв.Вставить("Комментарий", Ком);
				
				ЗначениеИзМасСрав.БылаЗайдествована = Истина;
				ЗначениеНайдено = Истина;
				break;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеНайдено = Ложь Тогда
			СтрукВозв.Вставить("Комментарий", "Запись добавлена!");	
		КонецЕсли;
		
		МасДляРегистра.Добавить(СтрукВозв);
		
	КонецЦикла;
	
	Шаг = 1;
	Для Каждого Значение из МасСравнений Цикл
		Если Значение.БылаЗайдествована = Ложь Тогда
			СтрукВозв = Новый Структура; 
			СтрукВозв.Вставить("НомерСтрокиТЧ", ЭтотОбъект.Запасы.Количество() + Шаг);
			СтрукВозв.Вставить("Номенклатура", Значение.Номенклатура);
			СтрукВозв.Вставить("Характеристика", Значение.Характеристика);
			СтрукВозв.Вставить("КолВо", Значение.КолВо);
			СтрукВозв.Вставить("Цена", Значение.Цена);
			СтрукВозв.Вставить("СтавкаНДС", Значение.СтавкаНДС);
			СтрукВозв.Вставить("Всего", Значение.Всего);
			Шаг = Шаг + 1;
			СтрукВозв.Вставить("Комментарий", "Запись удалена!");
			МасДляРегистра.Добавить(СтрукВозв);
		КонецЕсли;
	КонецЦикла;
	
	НЗ = РегистрыСведений.ОД_ЖурналДействийТабличныеЧасти.СоздатьНаборЗаписей();
	НЗ.Отбор.Дата.Установить(ТекущаяДата());
	
	Для Каждого Значение из МасДляРегистра Цикл
		Н = НЗ.Добавить();
		Н.Период = ТекущаяДата();
		
		Н.Дата = ТекущаяДата();
		Н.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
		Н.НомерСтрокиТЧ = Значение.НомерСтрокиТЧ;
		Н.Документ = ЭтотОбъект.Ссылка;
		
		Н.Номенклатура = Значение.Номенклатура;
		Н.Характеристика = Значение.Характеристика;
		Н.КолВо = Значение.КолВо;
		Н.Цена = Значение.Цена;
		Н.СтавкаНДС = Значение.СтавкаНДС;
		Н.Всего = Значение.Всего; 
		
		Н.Комментарий = Значение.Комментарий;	
	КонецЦикла;
	
	НЗ.Записать();	
	
КонецПроцедуры
















